FUNCTION NaimMes(lang)
    LOCAL aRes
	IF lang=="ru" .OR. lang=="RU"
		aRes := {"январь ","февраль","март","апрель","май","июнь","июль","август","сентябрь","октябрь","ноябрь","декабрь"}
	ELSE
		aRes := {"ciчень ","лютий","березень","квiтень","травень","червень","липень","серпень","вересень","жовтень","листопад","грудень"}
	ENDIF
	RETURN aRes
	
FUNCTION NaimMes2()
    LOCAL aRes := {"Сiчня     ","Лютого    ","Березня   ","Квiтня    ","Травня    ",;
      "Червня    ","Липня     ","Серпня    ","Вересня   ","Жовтня    ","Листопада ",;
      "Грудня    "}	
	RETURN aRes
	
	 